from django.shortcuts import render

# Create your views here.

def post_list(request):
    return render(request, 'app_blog/post_list.html', {})

# Это типичная view-функция в Django, которая обрабатывает HTTP-запрос и возвращает HTTP-ответ
# def post_list(request):
    # post_list — название функции (может быть любым, но обычно соответствует логике, например, home, article_list и т. д.).
    # request — обязательный первый аргумент. Это объект HttpRequest, который содержит:
        # Данные запроса (GET, POST, headers, user, session и т. д.).
        # Методы (request.method, request.GET.get() и др.)
# return render(request, 'app_blog/post_list.html', {})
# Функция возвращает результат работы render(), который формирует HTTP-ответ.
# 📌 render() — это вспомогательная функция Django для рендеринга HTML-шаблона (приема) и возврата HttpResponse.
#   Основная цель render() — принять запрос, шаблон и словарь контекстных данных и вернуть HTTP-ответ с отрисованным HTML-контентом
# 📌 Аргументы render():
# request
    # Объект запроса (HttpRequest), переданный в view-функцию.
    # 'app_blog/post_list.html' - путь к HTML-шаблону (относительно папки templates).
# Django ищет его в:
    # app_blog/
    # └── templates/
    #     └── app_blog/
    #         └── post_list.html  # <- именно этот файл
    # Почему app_blog/post_list.html, а не просто post_list.html?
        # → Чтобы избежать конфликтов, если в другом приложении есть шаблон с таким же именем.
    # {} (контекст) - Словарь с данными, которые передаются в шаблон.
        # В данном случае он пустой ({}), значит, в шаблон не передаётся никаких переменных.
        # Пример с данными:
            # return render(request, 'app_blog/post_list.html', {
            #     'posts': Post.objects.all(),  # передаём список статей
            #     'title': 'Главная страница'
            # })

# request — обязательный первый аргумент. Это объект HttpRequest, который содержит:
# Данные запроса (GET, POST, headers, user, session и т. д.).
# Методы (request.method, request.GET.get() и др.)

#     Что происходит под капотом?
#       Django получает HTTP-запрос (например, GET /).
#       Вызывается post_list(request).
#       Функция render():
#         Загружает шаблон post_list.html.
#         Рендерит его (подставляет переменные, если они есть).
#         Возвращает HttpResponse с готовым HTML